{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              8,
              7,
              10
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "batch_input_shape": [
              null,
              8,
              7,
              10
            ],
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              6
            ],
            "name": "conv2d_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              1
            ],
            "name": "conv2d_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              6
            ],
            "name": "conv2d_4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_4"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_5",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_5"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_1",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              6
            ],
            "name": "conv2d_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_6"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              1
            ],
            "name": "conv2d_7",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_7"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              6
            ],
            "name": "conv2d_8",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_8"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_9",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_9"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_2",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_9",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_2"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "RandomNormal",
              "config": {
                "mean": 0.0,
                "seed": null,
                "stddev": 0.05
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 1,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        }
      ],
      "name": "sequential_1",
      "output_layers": [
        [
          "dense_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      8,
      7,
      10
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            8,
            7,
            10
          ],
          "values": [
            "7eCnP3vgoj6nSpA+sa2gv/jOnr/bkcu+kaPCvyzoWDy4682+9HmHv+oFTj9RnKA/XbZBPs9b4L+Gl5U+BDqZv72uEb8YB5E/Gj0YP2VBsb9Flvg9fCcovpYXcT9dBiG/hDh1PPZM4L5yrJe+gJh9PlPe3r+qmmq/NKqQv6qcoz1kG6k+fKxtP8TVNj+Boyu/R1UQQJ46vb+MKjG/28imvs3nC78pQok+afysPtOElr4Y9Pw+5KVCvi1ZBb9hLiK/WikDQDUmkj8vVKm/ulN1vSxRlj8qpjE/tnmOv4o/iz+niVQ/aQCcv6wyXL/GT48/QByzP7gUgD7DpgLAHGbJP/vOaD7p/qa/KwjGP9ZXhL7N/7K/Xy+SP3cowj+mkKk//tq1Po9Z9D89HbA/VgYTv55UcD8M4N++M6hBvx11UT1g1Hk+EN8sv6qOTD14tuG/oShAPy5a1z/+RRC+FCCxPzSCjb9O3zK/g1dHP8gjlD4EguG+/ZyMv5TbfD+XFEe/IADCPm/dqb6NTCW+/JrxPfqxBz/Hl78+LH7Xv33RCT/9kIC+yVLmP7VFRz8TWi0+MuCdv3WxK7+fOv68962Yv8+9HL/MzVm/TCHwP45zLkD4204/Xv0Jv2xukr68FKa/PyanP/nZsT5cBDS+OqNcP3UNsD81TUw/38UYvuoFe71EmjE/QvKGP17FSL/dJK89ioewvx+Ya74Bz6W95g2uPp1pND/ug8K+MOaSvrpgJz5PiTw+xNqevuBOhr+m3my+2IAVP6e6uL8Z+so/ArGzPsxcir+AnaM/De64PgKbCsBLSDw+8MvIvqo0hD7/yXq/W6DuP52MpD+G75m/oMWvv6onF7+rbRq/ihGJviph0r8rc9s7bYg8v3TTQT/YF9a+dxGyP9aA7b4GALG/nljBv0dsmT2D7CO+VtXnPsH4yz9VKgY/tzmyPVLmqT/FHzU/cmtkP9lpL7/r48W/9YGKv3i8MD7rGSw/JVFFv4Apab0G200/nvySv77EnD2UwJm/",
            "EU9bP5rglL+GQra+nZEaP94npD19Yum/XnUjvtadBz7vBMk/Dg2bv6kxMD+s+B0/yI1fP6Efnr+XhLa/CECPvi0vAL+WJv2+81KzvkwoGb6V7Os9SR4fvpITDL/gOfW+g4GVvRv0D7+5rMy/8daxP9Nuob6GdwPAdZO1v/sSfT/iYLU/TSYMPikSCL+I7e4/xu4HPysL2b8MfLM/GTWrv4v+TL+VEoi/iHCUPU5ymr9ucGI8l3xmvwOnxb7OuHc/sSLYvNt//b5iBRo/62oQPmsa3r44biVAoVsOP9X2U7+vLf0+j2rMv7HPq79TVVC/ff95vycRjj8t7u4+FXstv1FBaT4v+m29eLSfP8d3Nr9IPu0/Mti3vwDZrz/dGgq/EKeovhGua79U+dY+fRE9vbfFDr1g0Q4/2dUsv5lhn7+Lynq/zAD7P3EWpL6ROq6+diqrv/0gg7+SF9q/9soRPloh8T/e3Di+d8YjP6hvlz9yK94+G8Z9v5Qvgz/JNLC/DQ13viEQzb9FKmO+mySNPhXF+b5I0nE8w+TxvT7RJL/FLSe/OGFAPx48Pb6407q/YYH+PVZdGsAtq4I/9xasPg4H3b9eWRw/ViGTvkIHNz+INN4+4DD/vtp1Fz+yJas+WlwrvyfzUb9pxaG+45SNPnn/yT5M7om/eriXv1szYD/VR4y/azVqv/cvjz8Ay9a/2pQ1v8a17bz2A7U+Yy9GP5YdPj7Zgr0/GRKpPg6iuL/2ajK/mzbUPjUZSb8XJam/EJWBPvqPgj/1oC2+RJO1PzXwnr9Yh/2/1tBNP2cx0D7Z6Ru//lRfP5hxsr6ZFBG/rRpJPioiJj1RHmQ+12OrPp4nxD7vghI/NS4nvcKDtL5u0uu8lCdTPyhHLb18qy68cPCrv62+HL8xOrS+yPDOvtyDtD/etz0/V7wKwOcG376uq9M8iauPvyHsF73uR8k/S5YqP39Ihr6c89W8LXiePlkzTz42UZW/TiPPvqiRBEDIPwnADUvZvmjxlD/CdsM/",
            "/InRveukor/S5bK+Ae8oPzCBxj6Woeu/Lx0LwF5l5L7vs0o+YPaxP7LZH7/cT8u+Tzk5vtwa+jz+JWy+yENsP8jOwz4c3JS/9gu/vb+7ID+TTlI/piRxP4cYQj9RQMw+qMjhviSGPr/xn2y/Qxg4v6izlT6Pq1I/Fb/mPqXZGL8FqIE/hXf3viBxUb/RaMQ/OumJP/mcWD/DG5o+sntPvVaW4DxAYFa/ShoCvh16jj5L6NC9rpY7v1sZRD5CMpy+TG1FP5v95b7b8fq8PFYPvwGQaT86Bug+0zLKP+Ggf78brmG+MYGEvoiuP76vSY2/jbVYv4JiVr9U94i/Se4xvhKrF8Cy+Gy/WwgpwLsx5b5F+ARAUK6yv7YRnz49l4s+imynvqSMur5xpWe+hkaBP8nBD7+9efY927jNPwudqb9nBIW/hEVwv4qllD+lOiS/seuhPocE3z/69wLAi7AWPr29vz9EqdY+p+NQv2jPcb/ac9I/lkG/P+wAB8C7s3i/5kUkPXy0ZL2NzBk8+HYSvyYeiz4MugNAzfaCvVxh/z/0lgjACAqKPkXMVb9kzMq+O7YCwF8KIz5dNIo+QQ2GPg18C76RpQI/HjIcPy/0oL4j4o6/EgyiPyjbLL+/oaG/3G2PPcW8R7+LNh29/Tn2P8SdDj9pO1K/0E+cv/ldYz8aOFe/FKW7P0s5ML+8eVg/GooNQOxPlL907Tu/j8ebP93VpD9AAsg+le8kPgrywb/rdMO+bfZdvmVybr9vAm6/YnPYPWGxnb/GJoI/QgCxv/R7sz4n9kk/zHewv/J2MD/Bww3AksmyuwLViz/SfoG/T6Q+P7XQwT7IJEQ+PAA4vwEPQr+9Ccu9weEQwH20Yz8tes4+AFxHQGevkL6joPk+vmVPvxb6Mr+ctle/hmS1vhVUgz61EoI/Xi2UPhD5mL8="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            1
          ],
          "values": [
            "ch3jQg=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "batch_normalization_1": {
      "beta": [
        "9SiTvYmvKj0pTIA905d6vf5OcD2dpTu95EV1vSHlcb0pp5U9tQuoPWuniD05x1k8zhiSvdzzmb2tfY69udZ9PUboa71+K0+93reLPf0Vjz1yxW29aTGrPcS4QD2NvYE9DgMdvVdimb1OwZC9UFGCvQbokr29OIW96WYWvZJD7rw="
      ],
      "gamma": [
        "APV5P6HeeT/fpIM/WUh7P5S2gD9/gnw/RSB/P+PGfj+P8oE/0Et+P5DagT+X0Hs/ooiCPz4Nez/eEIE/E/97Pyh3gj+fvH4/zHWBP/u6fD8ED4A/t/OAP08SfD++w3w/nPB+P7n8gj9f7YI/mWd9P8lngD+ShYE/4kp+P0wufT8="
      ],
      "moving_mean": [
        "OqtlQVEiEUCAGbDB0XpBQaJkKMF+rYFAwJ0tQc60f0EvCoTBmcFAwWsnnsH8DJTANJ+IQbw0XUEKYBVB4dBOwVi+hEGcKQVBgyt2wcImGMHT/1lB2XUdwRoUO8FXGz3BoZpJQdl5oUECDVdB/sFBQQGxiEFDvZtBK+HFP1aq3EA="
      ],
      "moving_variance": [
        "TuorQ3RGJEK8jdlDn7LeQucvL0M4z+tBPxTsQuOlRUMAUlZDPZ4ZQ3wIi0MKSUNCSvZfQ+IRFUOP06tCPVP0QkAYhENjRvRCJ6NrQwm/80JLHiFDED7uQtOc7kJ6rulCYzoxQ6zpq0O/MR5D25wBQ8/xg0MhJ5RD7CJXQo0NhkI="
      ]
    },
    "batch_normalization_2": {
      "beta": [
        "XgJYPYzAWL2801g9TgFyPXKPa73OZVu9OilMPZxuWr19plu96wdDvbBWRz0Ho1A99Kh/PUtkX72afVi9IgyhvGBRVL2ja1g9AKq+vGlrAL3opu68Cn9TPSFoGz3ZMU+9WRVePTeaa71JRvC7bdXlO+XA4byCUWy9mpUrvbkhhDw="
      ],
      "gamma": [
        "PPWBP97UhD89+oQ/+cKCP0nUgz9cnIM/hEOCPyhsgz/LKIM/zOKCP6Wmgz80lYQ/GDmDP7t8gj9vJYQ/OSaDP/fZhD+JioQ/pouDP9Gwgz+we4M/FNGEP9RAgT8ln4M/HzKFP8/agz9gYoM/TkqEP0mbgz9zyoM/lwWDP/Lqgj8="
      ],
      "moving_mean": [
        "jEprQf1nUEHaEczB6RZbwKwqoEGnY+BACTq/QfrprMGRbQ9BPEccQbf0nMFkgZdB5ZCwwYZNMsGM14PBDCmiwYKt/L8tkL7BpmjCQedWDcH4rRbAp/yTQVCB/kDhu4VB0MrNwdQyQUERZJRBJqNnQarOysH75pdBydKvPg4zVsE="
      ],
      "moving_variance": [
        "+TwyRIRLnERFiZpEViLeQ00GjUQOYN5DszxIRKAJRkRNuT1EhOQkRK5SbER3RQFEvOcmRPDhOkSB8y1EqZuORNYPo0SXWZBEMp+qRDuR5ENS6wpEWTM5RKNMdkPsQjVETf6zRAFyEkQ1RI5EpPo+REFbiEQxsqdEvcZdQ8Mhf0Q="
      ]
    },
    "conv2d_1": {
      "bias": [
        "/YkdvRs6lj2GB3k9Aq1qPIXHiL2blUs9fiZTPSumjr0ZZ5G95JZePQxrgTwHdV09zKISvXwUnj29DZu8AOKHPXCinz2zyza9M8uMvT66A71FVZS9xMNsPUsFmb0G64E9bGZHvcZeXb3jwHy9qFcGPdF4bj36Onq8GA1vvQ8DSL0="
      ],
      "weights": [
        "wjwAPuK7Bj1bnEO9KOX0vZjQ971020Q9wizgPQM3Gj3oXD69bCPJvUXQzb13zB29SEsqvWdjs7w45lO88Be7PSf6hD3ETJo9wPiWPU4VrL3sL8e9gK6IvIPJ0jwyRry9gJdqu0AtEjx2BA699QofO1b6ez1wZxq91FBTPft25bz5QGK9VH6KO9wx4L3aHu49Yd5APVFP3by7bwy9usApuv3ZGbzg+1o9Qt+yvN9Ob72M3rs9VAWlPR7GvL0A2JY3MICpO4cpu72WHSS+dTOTPVr5CL5Ofk89CDKfPSPpxr1cEd28y43kvHw7DT0dd4y8oD2iPBQMJD1GuYg9qvjWPXBSZD1AUAM7pOMIvXRP+byMfQo95hNdvXqzhD0E0989fAfzPcyXOD0weNq98OCvvULIbr2Ax2U8tCqqvWSbBj1w2g89dLaBvBvL9L0IIHI9AKIbPNNXuL0Aw6u8xM3iPU9S472E1Zk9IATiPIL2FDw4GY89Ia2XPOjs8j36lds9u+8/vP8xhzxFFLa8GRC4PR9EDD5Msx8+eeJPPagxCD6cWPk9bDQMPS1DrDy/nJE85qtXvdPUH73lG2G9KNR0vWUerj0tMsy9XuLkPVhmiD24GY89bwsru/U/9721Kq47XlWEvUFhNryS87+8qt8rPKBlajzrI7i9AlFWPZZtiL2DS/49Wm5lveJX6D1i6gS96aH8vMFmUb2gyN89GuA3vfyPNjx3npO9UM3OPXSuyDvvv+Q7tq7/PRFnj7u0RYO9cLLfvfMswb2A5eu9LZ+fPI1WC7580AK+gNdpPXTmWb0u5qM9uC6MveiOMrzKOdM9LMrdPT7ikb2I/B292CasvULsF71oEWQ9kR/tvSCqjjwm6o+99GrxPV62+r2fQ+i9LBvjvWwUor0QEug9yPhhPUD1nz36UsA9Ch30vQyN7z2QMrC9gHrNPABGBT3kpLs9xRPTvZEPLz0OOQY+Axx6PWyIlL0gWes8VtsLPv3DfD0S2Y67/+1kPUfjqz2Fkzw8",
        "qq0uvSzHBz7c7JM9aAjAvTToWr3g+E69qLIEPBrgBT68LHq91cu1PQhrQT1AiLm8LCGIPXgrX73mdGw8cmC9PX+9hD1jyqi9EnwDvXpmLLwHF4s9Ua2bvegRYD0ex649EOaTvdxW0D378eE96KmpPOLvJT6pB9E92A8QPUER37zkLym9ICkWPIZetb3nrty9gSWdPRGCyb247Ag9cQgAPsyJrT2fCFK9JstCvR6yiz2oSu68GwKlvWRSwr2/ZoU9kCH1PMDvc7tsPVs9qpF5vTbw3D0k+Ie8iJ2XvchBo72EyfS9MDP3PXutyL2Qjwo9hqLavWAe4TyOIaw9BAzMvAgl/b3g8q29qjWGvaCE673qZsa9CI72PcD9LL2AsOU8cLCaPe6H7z3QXMs9PBMavegKlr1exWO9gKTbu03ZFL3kdXi96RGCPTDy9LwN1NS9WSKHPAk8Hz2qIsW8pUoJvev7/r0r+Za9bK6Nvc96F72wwY09sDR6PXuIFb2WuqW9pg+CPasXvr3NjCy+nPr2vRaxFL6TPYm9pnC1PYTxur3pAoC9jAExPUlRJ72TkcC9vNytvWtBDr5Fese8k9ZlPZpCqb0Zhuy9aMKdvVbDvb3ChWy9FV6MPemiBb18uFy9h50NPGE0Rr2ItMW99LbxPZCKpr2StpC9XLIyPS8g070srtm9u0NbPbuNpb3ZuHq9cEBOvQYh/D1jD4093dgpvZrr7jsHx1A9uzPQvZhU3T3wOmM9dMFnPU9Lg70Cmqu9QWzwvUgu/Dx+/N69oL8hPJAGPD1c/Ji8EMj+PEzGcT0IPuw8okKNPRT66b21K++96rR+vQw9EL2fN+a9yZWfvUDkl7twBCq9yOtavVC+9z1meQi9AJAauMLszD1OBEW9wt62PYwvHr5RJba9FYe4vKTsLD3UDTu9vunVvfbc5z2bt5m82wDYPI9bDD1yXxa9qbN5vMioJr30phE9RuvrPXBfjb1+51C8lVSWvbQapr1IFzA8b+YWPVS3oL0nwP+9",
        "VFwAvfbCAD60hkk80FWyvU0L7j2AOD+9aKHIPGZ8tT1e2f+9TjEovfhQHj0Ay307WO6XvBQrvr1f0Ee9KJTJvd0Ejz3ig7K9Rga6vNQ+47rsuLS8NI5mvQUJnj26JZM8WKCyPTmTRT1/vK69/CNwPZAFSLsO1Lc9QKjWu+uhiL3K2Qk9q5FTPYPU4bxb4Vi9pDlSPZb2Wr3EV609aA0tPSBXkju7H9C9gO25Oq4exT2Yjgq8IGWxPMhh5L14Imi9YFuhPYA6CD3gd+Q8VSb6vRqA1b2otk89MD1lPSCgzTxVWem94MhEvDQrLb0QdKC9VsSVPUj+R724Iy89oMLDPbhlXL3cm3M9gISDPHNYnD3S4za8f/kDvvQWZj0AJwy95mm1PQB52r0xxbo8YaLAvPrn5L1TXGW9U/DmPZxSQz14UvE8Ns8Gve6q/z05QbQ9gru6PREwRr0DeDW+IdzzvcdycL1rLcM8iJDRPCL8+D0DIbK9n7/jvcxoB73Zy/s9dxj3vfvbJD1pA7i9ikKcvXzWAD5rTfK93rFAvTBMCr1guwA9mALTvRNHCb5QBvy9vCtrPUjloD2POfq9SIXUPMUTNr0ck/69aJjXPNv/lr1clBi9veYEPeanrL2Lo429eLS9PYpFtr0zNsy9ZNSdPbAiYD3mG9S7RqGAvQDbwrzXDNG9JxS4vW6xpD2AcE+7+K/SPZBIrr24RgQ9ftDMvRAaoz3FMuC9AFfjvcLbu71UYck9JsLDPQg9yz3ADCM84MFgvVRVPj18E8U9LufxPShimLzwZ8c8NXrsvar6ML3cjUK9LjmwPXC0Dj2M2bS9fqqrPfnK2TxL5A2+lYqSvcSR3ryQg9Q9IuyBugBBkr1OXek9jcmDPSbBAD5mfi49aY4Qvdha0b3gbeC7GIy6vf4Qz726Xki9lmMpPEArSL1cBZy9M5umPdU0mjysgLo9/iOmvWgwEj1oX0S9vTjevHBBrz26rZ89zCYaPf42EL1gEm+9zSiSvRaOjT2/VtW9",
        "dZQVPPzfhryFNLI9efBdO02On71Rwyu8TF6nPVZB1j1AvDK9EgqMvRb5Dz3k/MU9h4etvfbe4L3Jq5A7vl+AvWqJZb3Bz/C6aC37PMBMqj0pRtw9BlCfPZDSJb0aPqa8Mw2dvdAKnL3m29M9tmH7vTIh/D2qSvA9UKZTPay3OD3QmuG9CBI9PdxmMj0s0LA9ajXMvXrr2b3U0ww9IGKuuyDi8z04Cfc9Q7HCvWgYor2qMAO9GkRfvTxVRz2igIE9nuXhvSD/ErtcwT694KlfPQJy2b1Mteq93NA3vR+Yaj1cGvE8ynsBPQx4TL2cj0k97QnovWJ5ED0sTJ68gsTnvTYbmj1e+JU9/c4lPU9Pwr3IEXy94LbbO37X672+hQW98KkGPWO2QL2QwyO+PJzbvcOpub07BR49Hme+vfJH1b116JS83Q2pPRxvFbufQXO9WP/6vFUEjb1p2lO9GNmCPfpaiT0w+x49yED7PXq7fr3+6RE+OFf+vfn7qT2oQ2Y9eri6OyEisr3G0OI9WmazPfoFcTspyLS9gFQBPlM7pDye4BC+eFEDvtUkG74bKKg84mr+vUwhp70qsQO9+LQLPdC52D3m/688fAK0vSYq7T2kFLu8LoLlPTyJD736AEO9fK8FvejceL0GesE9Csgnvaoq0T0A3cG9vqGpPTS2orz0YsW83rP3PbTTdL28BZE9AKiau5u1rr02ieI98xLPveCTyL04yKC9BD2QvVQvirw0cZm90ATfuxjOpTwgvQ29oPM9PFEKg73PAZI92T9+vcRZ/rwq85o9E8BRPWoT3T0jY6K9fSlbPbTKwb0YWBk91qSRPbicQT08LKA9CI4lPTwsfL1EzaG9k1AjvTEczLzGY8i9kWMIvW2w8T19+TG8DEzAvK7H7T2x+uW9JF4NPMBB+Tzxpxu9xPehvJGZ3r2BtRS9Sy2+vQTObT002bs91umjvB7OW73vi1y9vexoPCactb1HHtA9oF8EPohTzr2kn2i9OBjDPPdw/D0GNl28",
        "6TBOvSM6hL30DaY9yWh3vRoHhT0ReOK9sa4AvkbQqz13tBw9cQN9vVclljyFqVg9mHCovWDWnjsgCmQ83DPQvAJq872AJxA9Mry9vRQvkr2oXMs9qLNhPcmgiL3Euaw9n7iNvSJ7mL3rFsu9KGGxPZWstr30WQ89ntQwvRg3b70Q6U48UiAAvRQxir3kgre9KteovSxU/z34/la9CpaLvf6h3z3meJo9kKUpvaO2YDwi1B0+zaVNvFTRWr2ghdA7Tv6fPQ6veD0culI67vylPRxKxD2mwWG9gM5PPdZ9EbwACNg9kpmyPatFuT2Xmb49br/TPYY+Oj1Cm/S8AEgrvaq9srznQes9EKUNPb4RTL31R0w9y20jvfbkijuITZy9rPoJPeHJhz32v029ENLDvWgIEz2A2K28W2oLvVqYvTtLO1k9ELeHvOVVC74g/4w8tir0Pcz1pb0c86m8tEHnvKwbtTyXrRy9HOW7vRk7Ez7TYQm+kDMBPjBNlL1IycE9gIqSPLhxcL3JvfE9nA+7vRnC1jyXJz29INT+Peh30D16xwi9ZND3vYg6zL3u+YO9PBUIvTAyLD3CUbQ98EqcPZ47mL0Y47481NJVveZ7wb0+cXu9gd2lvQgWJT0UWcW99At9PUx7CT0kSPe8ROGfvTIgZ70E80G94CzlvdhRnb3RfZm9gCZLOxioXr1gJM69YJPiPfEaaL0Pq2098ve8PbAVTjxwuby7DSXOvTH0rzzjwOU8CWiqvfE8CD6GG089rLYavVEOi7wyiYQ9YJWdOxhLAjwg+om99mSUPcSAhT2EAa68RYtvPdeFrL3haP480DOpvQCgKzmxI8k8lTCBvRuphb14i0g90IEAPXdDij3g2q49fvWlOo7ft73IOCi85JoWvMUefTzNst88EXe3vb3h+j3z1Jc9P4qRvOT75D3o5Yi99pa2PX/q8TytFjS9nJOsPQuv9LzYawm9PH6dPVaSDr5gjsm8YhbrvQ5cEr13iJg9u+48PNtvZT3JGwa9",
        "dIa5vCiO1j2Uzyk90N+qvYyjib1ebKO9sG7/vQJ67z2eb+M9yMy/vYb/5T00Q628qt8LvXki+L1CHb49fBF7vbyW+b1JHZy9/j7GPchxuTzmMNw9FKzaPdAhtb3W1cm9D6f4vWjT2D2gakK8mNjjPaTgj7xFAKu9IOVavKdXYD2W4+g9XhcCPjBNgj3I5bi9BbffvBM+sTzNfw88OR/QPZmE8TzGO5a9ywOovHSZgL24/se9cMMjPYv9vD019848JWaUvRfidL31lZO9KNOvPbwZ07wTd7I9+OmfPDBS1DyJ0Lq9beqsPS0M+b0epeM9SjO8PfELb72ar0q8joNUvbx3RL2gFRm9pC5jPQcN1L3IVsE7FsNcvYQmBL4/ghq9Uok8vYrK471IbN48DM6OvTBBaT1ZiHC88IuRPcHo8j0H67U90VCJuwoogj0NLts9SGrWPGDkizxRJKc9V9z4PMLhzT3SUHW9mKvdPBQhqLxCWLG9IJFRveAVubxkiFu9yErvvVwNH70jkOW9HIDUvag3Ij1Ml/28IHsnPA33xb1ZPe29wJlDvGD9LrtYQHq9Wx6IvTDYOzwAxTY6APPKu2rg5D3o1Wc9FqOyveBMDT2/9du9KtSLvZxWij22B4g9OFBJPZUg5Tz3ZPu9CmT9Oz5xEL2gRqQ7MEeAvaHI271YQBa9wpUVvWHtjT3p9dY9CCfFvaonlb1kx/g9LjL9vcOX9rxpXPk9DiNBPb0ZzL3n5WS8kV5qvbAS1zwQAgC+ns25vU7kg727jq68Qf5svTEkoD3/o7w9PpyhPUrTuzw0Pgi+MEY7PejHbr2y1rg9QFTQvWO9hj1GzQg+q0IHvv1qiD2kvOc8gqavvEUAn72INoI9KlU+vSmwBD3NJ6g9QW6MPTqTHj1bPJ+9uS47PbiF9rsr57+9gPXQPHYznL1RTqg9qWLAvcKswz3rThm9KBbOvb5Nxz3yypK9G7b7vfZHRb0Aa/I8chi/vcQ7FT3sHZs9csQ6vfvYyr3MRu89",
        "CPAKvQYFsb3cjF496TLQvVB+sLwYdiw9yMf4PGqfBL1kfUY9XJTlPfQkV71wx6+8IKANPChOAD01zMi9Go7JPYjW1T3GRGi9hoahvW4hEbwcMIc80rhXvaCdSD0oAWk9ePCnPRBgpj0zLJe8CbI5PcRoeT3q/JE9aSfHPDKBBz4wsf08IKWwvJzRyL0fbYm8b8tRve1sPr1LvEE+Yvm4PUlru70s3+w9sjmMvdw3cD1a2I+9HeuUvdfetT1KSaW9ZkqxvW4BR73W43Y9cmfWPeI6uT14sZO9Wz6tPNrpzTzrlf89HHUFPvlxiz0+ls48CqItvdmUwD3qW3u9YBFRPY5g6b3CLUk9bG79vQDTBLdSlcQ9jsq2PSTjUz29bry9viH9Pfg8zbw94bw92irVPXBhiL0r/rY9N43uvWYnxL22lPC9pNC9PbBZSzwg7r872kPBPSfAz724E+496Ha8vLyOx71glUm9CIupvTSQgbwUBSQ9zTnVvbjJCL2EwtO9YD9aPQBCCTrcpr68EI5jPdoGmT2kATQ90K/HPMS+eT2AgZu92IdKPURBiz324He9BoitPRU1L73ENee99FUxPfzV5rwg25G9t2m/vcVaWr1lMem9fA6+PGpBBL66lsy9o1cMvkHaAz0PoPm9oa6cvbdrGz20ZY08RRZcPTuuyj0gWz2+DMLbvbZ8wL3pP6Q9AKC8uxXe2r3yCFe9jFlmPRIEpDzXdjS9BMgvPdDcAL4pTR69B47xvQ3W9r0Q6fC9OiHhvLX9Hb3+zpO8FFGVPfSdFL6H3/O8iLAOPF/A+b1YauE8slQnvdLjxT2KYLw9uo6IvVWDFb2cayy9l8HPvexQ6byWY2o9QHNePDghmD2CJL48Lf82PXyBmj3FeKq85ATdPQBWhb0uSRy9gJprvSr1pD1os488ns6iPVQKGj2MPX69mr+CvXANqzw4dtI8ACZPO1Dx5DwaECi9lt5yvQM2pr20B0E9uAKBvNAG/T2aUxS9ZFuNPS4sQb0IpKQ9",
        "Xgp/vbi6Wz2aNIG9pEYWPQxb7T0GZ2K9uF6UPQTarL02bue9+DNQO87goL1eE9w9EBBbvHkenL24jG885+KzvUA7EL7qxZK9fcdPvQuVpL3RIcW9YNqMPPdZUr0+r7U9+gzPPXY15bzu0ES9PtIXPY95ej0kiQS8AeTcvUpwzb2Y9ts9XegjvdJmy71Yw+g9slNPvRlz6r0cn+i9H7vKvWwQkj1GTaC9vW6WPbVWvDp1xI+9JEWpvb0wJr2ujsO8MazUvehDtr0ilrO9jKkmPdC3hb16p888qqoLPndV2D341xq8K5h+vTY88D1Vfgw9fCnlPTANgjyCY2m9y/jbPZ+gHTtX5pE9ip37vf/E1L3IWLE8XDFfvbiUw71+aJu9GBnPvXqhmD2QULI9vFKivJyH1bxA2QA+MIAnPAiK+D1QJkS9QNhWvEzewz2ggTk8yCIIvUJT1j3Ebdy9bne4PdwdJj0CcrU9rgyTPRxcfz16Zrs9iL2fPTBzbz0Y85m9jEHHPQl9CD24WQi+21e7PThr+T0wb2M99YHJPRNTEz6lXgc+pMTZvAD9vr3cJ8K9TTedvfwESj2C+mC9QOf5O59Prb0fJSk8NJu3OBhZgTxuYQ8+3t7+PRJ91DxMNXO9sNumPSARgD0tf409dVVLPe5Oqr3Uz089APwEPNQEeT3ipe+96i/+vV6ohz2neay9FmapvfXYs70TPbe8Wo/lvG4WN7yhxoS9PeGrPdpykL2w+Gk8BM71PfEr6L0sQ6e9jHnvu6iO2r0QwaM91HuAuxaVwr34xgo80EHsvZx4pj1hkQE8DyuevfwWp71sm3U90KvQvQjtGb2MYhK92M+ZPHZE0z34SwA+VNi/PQaZuD08xfQ9LI4uvdClbjydv5O9QKn8vfBAzjyQNTU9cgPIPV9O470wKQ88WJRKPYKl9T3wbEW9oPoEPCzcTD2gPNM8RgNuvYT0S72sP4E9MCvJux6zoL3oook805WivRvN9j2IZ5A9+BYNPlhOHrzooai9",
        "htvxPT8PvT0OCrs8Q00EPgqUjb1tHKQ8zxXDPEeJnjz44H09pAjGvYwNlr0Zl2Y96velvCf1BT6OrSk+hQ17PSMn4D1F0aU92IEZvTw68r3iNfU9JGNZPW30hz2BHzY96C+LPebtxTvKytu8f18cPQBNiDwYNkg9d5x5PbGyMT0zEno6eYVxPYrR6z3ztxm9TalHvSdk+z30Eik9EXeQvbhMmrzOxto9pfXFvQisjz2S+x09t72EvS6nybxlTBg+eA3lvRw5sT1qv4K9Wj+EvRTmirkLoEq9zIAYvfRxhryciGs9mjq7PWzFAD4gR8w78KzBvCQbXj3YnXM93h5uvb459T0ATAG8ZnwAvsUz0b1qtoM9UkjZvcR3nz24s9y9oP+KvWo8k73stfY9LKUAvurDiz2A9LA7YlOYvUCTw7yoJAs9GK85vATHhz2gdTY8gCfdO/CszT2v5u68EjWSPADk8byUo/u8qkP4vWEhiL0fLs+8awgQvdBC+L2OTEU8mZD5PZypBL58IOA9GXz8vaul5r1ICq+8AuFxPGb9wL0v7oM9NgGbPNU4CL2kLo899k8evYiQtj3Vt0G9zmLiPey1yr0z9ca9VoIzveTEtT0GyUk99FuxvYDMlD02Pne9tS9PPaJOY711+VC9mCFJPdwWAL4cdK68An5wPHCd7z1a8NS9GJuvvXn3sz2DEsw9km9YvfCW/z2p9zM9fPGFPQfyU7wCjwI9GpCDvTTQez3qlZc9PYU/vAqr/D0K0ra9ACgYu0AlwryCsoc9eGjhvGLx/701ae291LzLvVygOz080rY9tt6cvTWb5b27Ec69oCSwvZPbkL13pby9XFS+PTwe7D10z/q9JCvZvcBK7Lw0l+o9gCWVvSQZEz2ISMk8OPqCvZQpmz0txMi9YFtyPSDRBj1QG4u7om2CPdMZ7LwUlK89d6KnPcZNwz0gAA+972KOPeqfmj1cPte99//7PRNAMT5Fqeo9GJyTPbxvTLxiuPi9UOA5PQ1ekj24Ebi9",
        "ghUVvEzV1r2Nur28kvoePg/SnbqKvwU+Ghj7PZc+6b1HSDs8IwOdvVaIlL1BCl69Nv8KvVmkvD2lGUI873vVPWgJVb2Ls7C9giu2OxN7Hz6LsfI8MtmqPXr/Fj6sB4C9fB+SPf/xabzwfCi88HL+PVCcvr3H+re8SIoEvTTqhDziEOU9500mPjjy0r0+oMm9aOt9PUhC4L2z/Hc9OgmMvesw7rrs0DU8JLFmvYDR77v0FOS8Umq5Pdpsdr0MCZK9ZY7mvfzBvr1Qyoo83lyrPVhyrjzQvjA9aE6kPR6UOb0QsOw8kOu+vaY6l70AQK+6/lPjPbjthTwQWOg9BErcPSDw7T2InI28ekN/vcKROb0igRa94HxyuxoB0D3QBjS9/Ol6PS+2Aj5i0X69OuioPUCVdTyAouO877sFPtnmXz1t3os80DnpPL6FED5H5ts8oa8pvYQMHD4jQJq9fJiCvWbygr0Xnau9ReO8vQS9dT35y3o9gykNvS/ZjTwOJBA+UFgrPFrw6L3dJhA7MrQgvT66K7uZbZQ9EskmvRoCkL0Vb0O9dzX9PZD2tb24w7g8+8HCPVJOTjsaxkK9jYIYPknf/jxVipQ9B1zlPbYAqj2YEpc8ePsOvP379T2MBbk9WgzEPeqWCD6Rqgg+NNpHvWUKhD1On5g9iLCWvdhxIb2iLda9qbeCPT9zzz3cn+08QDBhPYzcJ73gjvu7vDgJPSJ+rb0uafY9XGGDvWQbKb2AtPc9oDUtPXiEoL1U6ia9dIv2vbr/p71E/D+9UC2YPHQ2gj1gxgm8XsbIPWA/9jyAtuA7QoW2PXT6Mj2s7mA9MjSbPQrWYL2wSMW88MnMPeCLwL0mrre9GLCcPVi+Bb0b9sQ8THbUPTrelT2wbG08ZJhFPVGUh70CjEi9eZpXvTACnj3aLQy+r8bvO5dchr0EM4Y9I+fKvZphhD0Ii/Q8xq2TvdxcFz1FKgW9Ph1AvQBWoT2goaI9WM2ZPRjwSb3O2R68ItCoPHz6Kr2KpDQ7",
        "jubKvZhHC70cAci9qZF3PZDqDjzQGlM96i3EvVttsLzD2jM92cXJvafl2rzRTEU9ovryPBBDx70MpB09lYbUvQodnLyGhRi9TJoHPdjBkL0d5Qe+stXZvTax4b2keL49AvXCPRRK2r1KigY8l7rRvR03+7xETxk9CCNMPQYFib0siWI9gLvgu0pMC71yd+U9FLUbvUj17DxT16a9XLNsvW22sr1Y9o69QN4dPM46zD1E71S9ANfAPJRx6D2wC4k9xiBovXAjMzyQcHY8Mk7rPYSnaL0eiqk9FOsBvcxKKj1URYU9QK4YvRql/T2ZyYe9cJz7vVnwCr1xiKo8X+HivYBSazxUWbM9wVUKvlAeWL2tkYE9M0EOvvPmLb51z3q7qE8hPR4w67zQ2k08UjzXvcV06j39dwC+4XfevfvwmTxElDK+hbvjvNrjjb0Q7Bm7NPblPXZlNL3ygQM+kddmO+cS+D3alr098Cetu6kqGr35yOS9CpjUPEkpmL1U/JQ9qQaLPQvjGT0Qq8W82yyBvXJQvLzvtwW+ex8APQY2Mz22Zc89Z53Kve4g5L1R1H+9bfpsPQZMxLx8upe9/2EuPVbUSL3xXks9gD4Eu0XstL2Yx4s9gwPiPYVUCj6orYW9uLi7vSD+Q73GDdA9pEb9PQDjxT3waa27UH/vvNChqL2Cb2u9ypHFPcRifb3s5ny9kLkbPMytYr2weAI98g72PW6L5z3ndgC+4PP7uwBmFDq0Sbe8PN6tvBAoXTwQ5LI9KDTWvDoS1b3WBLk9TI6OvKAkbT3W0N49Wp+4PV7ECz76+3q9uchcPCDrwTyhxJ69D5CXPbbVij0jdQU9lTedPaUWjj0ji5e9eUK+PRjoijzo8T+8ANn2PEvInj0bnO06eRtaveU0EL2Z4AY+nZgTPoatALzzIuw8KgxzveI4Rr1m5q08+rTSvBLRVD2N2cG9I47dvdKOlT28luo92MyPPTC4Mr0EbaU9ekTkvT7yxT3sMxI9knevvVIaPD2glwo8",
        "vcgivArWN73vbZa9EHH3uwjzbz3lZbe908+8PbTmQDx39wk9j4TXPcRQa7w/xs49JquivRPx0L0gRe86WsDqPUE6lr03kAs+WKX7POBAfb0W5he90JJ7Pb46ob2KEUq9YILuO/IYF72oF0u9KFeAPci5MT2aypE9OAjBPDR24rzCQrk9VsNJveQQzj1QK4Q8LxK2vTiOhL0A0xm6yNucPc51kr12O1a9Yu3pPShiNT30Ojk9jsraPXmRt72YqoY88CnwPeTfRT3X87o8PZKevZZm0j3UzVa9wOlnvR6k2LyuWK89KGkHvoI13T2tKai8u0mMPZmYTT1g5ao8qBpIPXhzuz1508M9oWffvUcPeb3ZWFO8bFOAvSXPqb3I33Q8rLq6vNRqv70dOPI69inXvRle77yyTsI9oMLXvQtp67ybkcA9YkeXPO/m4L1MyIY9I+9YvRzXEbxdkx89ruEhPXMdID4S3JE9/AnTvU/Z6LzA5tc7EMWlveyNi73MFWc94UEqPZkRB70RcxY+23k/PYGRDj0nQ4W9XCTUvYxtI70F1No9T+gNPYANiL3VhOS9/A3iPVi4wrxYq788MPAavbq7jz3Wo6+9npLOvaA37j1oYUC8tC6cPYyF77wqoZA94FOZu9BQlbykmmG9aPmqPLigYT34dfQ8IpHavQ7Eob1dXfu9iFGyPJ7ANL24QRE9/EIRPQgayTzyZ+890kfrvYrymj3aUAu9mPTdPUatXT36rjM9uVYHvvC51Lxw4E49VUoHvksfuzq5n7S8yASNPfUg2L386mU9ge1Puj7EG75M9OM9roatPf1ed7zq0dA6qZDgvbpe1DzHpxe+Yplou9yGELvkg869SozBPZjv/z3vD/o9NlOzPeODgbxTr4S95JThPVvbdT14Qga+NekAvQH5373wFRQ9q59NvQLkkL31N5+8YQylu9fPqzyqWYi93YaxvSs+q73Eezi9sHrMPEN8Ez1SVyI9o119PSCqEj0b5gi+ILMDvpD8L7yu3o68",
        "qGtXvODyZr0MHpo9D7L9vYYV1jy7AAc9mDT9PRmz0b1USc+9zqkXvXiqUD3H9f299NtgvTQ0yL1sDpg9hEoivUwZ2T0yPPe9bClrvVbG+j3grhs9aMmXPb4uS70KtSa9sOnOPTx+xL1AFjg8vgozvb59wb1sADg9jKjpvXS7CD0g62Y9gFKbPPpcPr0oQWA9j4DFvawsKD1mkIG9BYHJvVijkDxKZ669Lb2HPXhzRr3Shhu9wTtXPdUWlb1xu8e9aOWrvW9AwL1wZak90NWavd+k3LwkVW+9W4uTu09S0L1iT4g9Ay91vdEvpb1SW/A8sjCRPVbYkT26jHC9pQirPWyYPj1h9fK8EK+gPOoCpz0B1VQ8YMYBvJT0BD04Sm68H13YPWbxiz0oIcu9gw6mveoDFz4cba+7AOsiPT/zpL3kjHu9QDnkPJBxyD1t3V49ePtgvYQFAz5Egn89JTmEPPiMPr4ltbk7IL9QPAio8rzr1HO8Xt+yOyIDyT1xgYC84r8DvRw/fb3sJOU9LIgEvWL+4r3moqQ9YCyju8BIbT3+5AA+zs+jPfwvzLzQGF29ZLWDvQreuz3x3O+9bKjkvGKmhz0+LNU9AM3Ou6j51r0Uobs9+oWCPfxprL0AJsg82quAPbCx5LsMcka9ZsiPvcvoAL4oSGY9sAzJu8g8eD1JffE9DTsKPq0m/r3kBhU9R8qFvClhlzsCvZe9jEaLO6uCNT0C03K91q8xPulYu7xUayY9jIijvFUZeb2Ytgk8GIDXvXhsAz6/x9A9v6SYPUmzSb2i25W8oOmeO/Dftbxofxc90TSAvdgaAb0xPLC8wIXEPVYe0Lz+LFA95r87Pe1gnL1QFsg8LAYpO58Rrr2az+q98H8tPTmiv72thvk9RTICPt1DvD2add298j6pPadxAzwdJcc9tOkLvfXJez23LS29MdFnveT5GT5DbZc9BAVQPQ7DnD1Bk2g97ruRPQcOvL19F8A9NMr7vSnX370Dj+y9lqXhvZ5NjD2z/ui9",
        "AK63PIi55j1YJB893i7svYTKsT0g7049mOVVvFfMy73yjTm97pPvvRCYTzw4ssg92AfTPSjd+j1aoJs9XQCZvVblvb3ITKC9Y/6dvWj34r0KFQu9xviEvZywIz3UtR49An7Zvf7ziD0sRaS96E9ivbTjDL0pBLG99xC5vVWMpb1KfiA9cHYKvZHh1r0enL69QxiXPRxeYT1gdJA9XIBDPQCy7z31fcs9criCPNQcB73E09c8I6UTPVGoJL24pXi9JQapvVK+p72DDTq9FWfUvSnEij36TKe89okLvWmk/L3d2AK+HtTkvCK7uL0cZNC9PufmvUY0kr36s6a9beaJvPiR8LkXD4C9L40tveeJUz2GfPQ9SNSQvfHBqr26x/492sXKPbsaGb01sWS7DeOEvEeBybwgV4A9VkKHPS64fL0ByOw9YtFMulhLwr2lLcE9GmO4vaJ82j3ggoA9zP8UPWw+nL2yzze9ph2kvT6dzj38TGe9pDw3PXbqsL00vIw9d2vCvRbb+z2M3ik96oKFPRzwxz0ISEM9RGNRvdTF+j1IyqA90qObPXaZrr0pc/u9oFpDPQy6+rwKW9y9gNvqvFCxrb2gocY8rtq4PVbTB720D6I8iEOsvRjAsbwEVUM9OEiFvG59F73skzy9dm7zPWtgmz00x7E8w/82PJMf9j34TbY9Lhi7Pe4Uub0m/RQ9sFKjvI2xe72iCLE9Me1OvfK6vLxGuL09EpPKvRCAZjz52w68FIoAPZnl671A0mq9+HvwvdwFVj2z6PS9eZB8vcwHvz1KIxi9LIWzPdPCl73bHDK9QglDPZkY+zxJrPk9ZOq+vVzPeD3UhcC9ihi3vchQ6D3BLZI9dIVOPbtcp71hGRA+5wbBvHgqmTtDQ4A9VE1bvRjdeT1Oxfg7+1kpPVJp9z1AQ6y9AE8wPc8p2L25/fa96GjgPLQ/o71CBr+9zK3yvSKs1z106/A9ABiruRrH/b3Sxqy98B8aPcRUV70gS6y8VIUDvTxz2z1Moh69",
        "3AnZPaIMQ71oBS682DK5PCIM+73gE389GF19vJCzhT3AGOo77lG9Paz5Qr1QRuO7zUm9vTxvyLwwHs88k37WPV7weL37xti9PMq0PJp5pT27CD48Fky5vRGPGT7VTvK6gcV2vS6RpjwWHte9DN5OPU+ebzxn31k9zWxtvfvXVD2QFwQ+rwQZvXVjIzzzEMO9gGMcu7fkgb04x1C9glWWvbYFUb2566Y7fHTIvDxVhb1DxwC96BXMu0zHpbx4n5M8VLi1vTWVNb16KYk9kJYIPZxgET757Oo97fudPZRBSD0UyyQ9tWyuvT76aT20hmi9IcVnPeEm0b2IfMk907vkPWrm37w4awc9iFu3PeY96T0LJ9e9vtJrvFR0HT3Ao+09sE2xvEjYdT0szja9JCKWvKBYnj0A7vk8oPIHPe490b2gTE49Gu0GvWRhyT3eK7w91qSDPQiroLzoIj+8DH9tvYBSyrtQqig9aLMOvLYUnz3Qq727uOmQPSZGmz1i6QA+7hJ+vYSDOT2EEQe9mLhwvOZQLb0AKE89dPe6vWqdAz2MoLM9uNg4vcBfTrwIT9+91enIu8iVtj0fijq9TqrTvTAwg73hdK29XCTTvU4Uor0Sd6q92OVDvPUi+T0jMDU9xdPLvJcOsb2rm6o96EwHvgEFWTxfosC9RI8OPTQ0Yz1+Qde9ECizvNzElb3f2/y9d2H2vZWcib0gQpi8le6Rvfhb7jz+JPw9bmolve3m/L36m7Q8wX5rPKrMnjxQNBm9z3WqPUiNnD1wiVE9LKfHPaRxrbvjlpM9dtnNvUj+Oj2RLbk9X1bgPey5rT1t5dy9AKdEPHo6sz3+p+29N3AZvXckVr3MPNg9bj6NPfJQ5r1Agqm6g/f9vcrqd72wa+Q9jP/OPcwFD72EcOk9aN7XPRju6zwUH2I98DGHPeA1sjwhIqu9Eui7PQ43yr02tco90oTMPYCkgLr4xL48sG7VPQooZ73kQaW9tLL1PSjfej16/oc9+n+1PbCPrTxTI/y9"
      ]
    },
    "conv2d_2": {
      "bias": [
        "ULJlPReWDr3l0Y89GrCSPXsmhb3tqmg9ejadPf8nir3RKHy9fxSJPfC6hj2UK3w9bY6MPdE1STrlpHs99wiKPT5vi71rSmC9mm+SPRW0iz0lqXS9ScwZPOgIib3o6nS9VZaJvTM1fj0myoY9hOWPPZobhT3T+4w9ODnfPD/UhT0="
      ],
      "weights": [
        "PyK4PdzN8TvIi0G9TLf8PAs+Ir2E74K9tt1EvWabQjt1xkO9CekTvh6muLynljq9CXfHPfP1eD2rJsC7NE6iveursj2//R6+lgIPPR4GwL1JnhA9LfSsPbY0Vj2Urve8u1CcPJ/B7L2JmoY9wzCLvcyDCD3sBrg90yAHPhMfqD3PFAI+dv6QvSyE0D1HDMs9JrAhPXeHGT1IwTw9t8LBPePF3b17JfY9+evrPRBRXr3c7Py8NNHUPWif/7onm3M9XHeUPTkTZz37ar295PR8vCq0Xr0w1HM9XrMjPl9w4LziuY89Tg9CvVb6Wjzr6ZM9RIqbPGDmwb2DdrW9VDosvZE8bj0ARaG9/3NivYrTAz4yiNG9YWmlOpVGGT1ELmO9+rj1uqzXzbxW3AK+HAk3PVYCyL3NPFk9mNQdvUUXhL0exLy89gZsPAsMpr1wKw6+1cyUPUYmSL3sSym9/o0OPcvHzL31aOA9t5NSvWrKzT1+4D89piSPvSeNn71Mpte9pXc6PRYU5z02Ysu92ChCPCDxJT3OwgA+GgPwPH5WmD0Qa0e9FJNzPJpX8LwL98M9BhPvPJtGFb4n2JC9pkPsOYKow7wLTGG9onddvfFch73oRuy9RIEIPedl67sKqtQ8BCiBPQ+flb0Rg+C81r2HvV4a4TzyPxC+RtkWvr/YxD1dbaG9pal8vZZEnT2sOom95VyMvR/HDz1A7SI9neToO4ecnL2+Ypw9FSe2vaPbrz13lJ+9yeP/vST+JLybQSW9iJ5LPSkLP73WoQE97vgCvmmYEr4EGBw8ZngQPifAb70i2QO+fdW9PboJzb2GB9Q8z5m1PYtpBb1wdMa9irJePU76Qz0PU/S9b7YJvnjUt72/umC9yeMwPQEM7r3yq6O9EQN0PVDcPL1dTd48kI43PR4k5L3NNSq9kbV7PUfVgL3ggcc9G2oAvhWPrb17IDe9qSc4vdVwsz2McG68nVnivfuQz73q6pm99oMgPebLqr3J+vA9eYGlvY8ZHL6d1zg9",
        "CVWGvLZBBb0w4Z+8q1apvVOnOz1b/bQ9sVLHu4zM6bylu869CprAPS0DjL1u2mo8TLiWPQ1ojrqP5g+96OMWPb7dfb2rtMY9Vs9qPa9p2b12A1m8LG1+PU1zD72aT4k7X7YbvcvusL2I/O695+srPV1zpL2DWt48eWmKPIvszj3+qZQ8YreMPUXAiz0QTpC9FvMCvhyyhTx12W09mq0APeM9CD6Q0tA98wCovJiDnj111/e97pgEPszq0r1NxF28W+m+PQ0YWL2HoPQ8MAaQPdpHHz00i7C9IQ1MvWlzwj05SCq9CSmVvEB8TL0Uvq49atRQvUH5rD0O4J28MXGzvCNlHj1wN/y9qABaPQizTL05bky9vycGPfsIC722V709EzeZvF/Xfz1hAf27i1MBvrRoLz34KJU9AlTBvOBMd70Wefc9rRngPSnqkb2Qvcw8R9gQPpNQAj3gMzC9AzWVvfsXor0J/IE90iJHPewiujxnc6M9yXgqvDuJUzyJlFm90nSzvWPn8L1ZXt67+P3jvY4chzzJtw2+uChBvUBdEj3ALWO9XmgFvBqbWj2uamQ93PuyPfDOwj1dqxa9FApePSSTKj2njYg9kbosvVACArvwINw8u4eaPdBrr70G1Q68AxrTPfeci72tHOg9uC6sPeZCtT1HY4W9pUrJPRAZnLyc7RI9GZrkvYL+sz2vKJC96efUPYwpDD2uw9O9PhcCPZF84DwU2kQ9YwW7vWBBgrwU+3U9XbQXPg6+ur180aS9IOnKPSm1cz3bIpU9Lz21PQBvGT54H6G9brK2PJ++Cj6uEwU+qD7pvf3fv70Sa6E9ivxRvXvoeb0suCk9Wl2tvQWdvD0+9oQ9solqPdwuN7wN85g9kJkZvrAm4D0lDMo9P73CPNfNpTwrOL29bQGzvT0ziD329rS9oBUGvt1w3r1Ltus9SItFvTK+xr3NsAo+oSaFu2Jxqr14smm8pwfPPcswojxQfmC8de6wPWVVA74VhNc8VHXwPYlRuD261MC9",
        "O+MpvWGJ4r3UDNU7sMShPW+iBL7aXvQ96wcLPcufoL1xPY296QLhPdEQFD2hIqc90IThvUrycLsmLgc8Kw7VPeR6Lj1geBI9l4LDPVSOOjx/NY89FPjKPci9kryC5re607pivWCP+D1SmVK99fuYvX6q272ppO29QsAmvr/GKb7UC3O92boAPXL1Gz1kB8o9VMMtuyxp6j3O9oa9ze9JvWg3l731q+C6DdNwvZHAezxGM0694A+NvewJAD49FzO8y7goveo7BL2xTyM9y91CPSBQzr09hD29SanOPextIT2cDQc8nUDRPRtyDz0H69e6KBlluy0cfL1oJ5m9du1jPaT76buQ0zI9U5o8PXo2DL7gatY9Imj6vF0nSD2Y9HY9fxzvvcgNhb33eLg92VdBvdg6ML2+Aw0+g2EyPQG24b0RwPQ9wCTqvegj471WH749LNyovecbsz1njxC+nQPCvOtA3T1GWJg9gP1WvbxEWj3m8s4917Q5O6/Pjr2G2+S8vnsBPQaBED5Ak6U9zkmJuynDor0JhZS98OYkPai1tLybiq06oaKjPfpBxby92ek7UKH5PXKjqT3g0h88YRkNPWx1J718krK9avHfvTKs3z2Q0R6921lbvAibEL6Bu9Y9+ivxPYkSiz3K9K09mOafvSJ82D0heVS8CeDLvFaTwb2D2qq92RM7Owg8nTrRX4u9aWscvYOh+7lq4KA9vnSyvbT81b3P1Yi9YP6qvP5t8rwS2LU9FuLsPZjo07z71xy91L6cPP5OkL25ULg9MpqBO+kJyb0+eD290hN/vO0bmryngN29lt3lPUgmRD1ss5i82p5xvKybOD0PwI69OGpsvZ76gb3sGGs8gCvRPMKNUzzte6O910S3vb6ifLxyd4g9S1e/PXru173Bwvy9RPspvapKPrtCOZS9vtEFvCGGdbzJqXu9rT7PPF7Adb1YL7y8U3iLvcAiqb0OnZ69+FTmPfCmyT3nz9u9MT3gvAs3W70uRdi9TbUAvOjYVr28IBS9",
        "DkQsvAnq8TwVEJo9vZxpvbgVaLvpqWw9gGHZvG4R5Lyq8uQ9BGOcveU06b32n+K9kS5XPXyo2z2TyW+8W19fPQv6oL0m8pU8F4qMPcI4rr0wCD09W9SGPUyZ8L0E8gY+TupnPWJkkrxpmNS8PjI5PLZw7z1Lg+O9uRPqvZv/ij2vin49qdIBvCbJU70uz8a9xX/2vHib370ZOfs8om5RvSMgTT3uzT08b0W1vKX6rj18pmG8/BMTPQudnb2Foqo9lFyfvTq7dD34b/68HX96vf1gGj1tu6k9HgfXvTpQbz1yWSq9JSipvdAizjwpYxs99YTYvcungj1pZcy92wdfPBV9Nb34Ktg9TLFCvZN8AT6W8aa9j3GqPZ1zjj3o+NK8iQnPvZqeEr2vy5u8JFOhvevcLj0Wd5896Zm0PUhHbL2l54s8pvW2vHZnpD11I9c92xpvvWOptz2SMHy93mcGPXGJqb3g2Ks84K2IvcLzyT1HwiO9oyAcPY01W72MvoK9SBSduwS5bDwtLpG9SEj5u7jc8T3vX/y8p5DRve2FB73yI5s9rE1DPdCqvzywHMC9BeaAvetZw71ABFc9F9rdvFjx8T3qTWU6KLXCPTAMkr0Tn4w8+CmqPb9WXj31ZLC9wMnBPb5l3b0d0V691LUpO4vrCL3kzfE9mRPnvXXT0L3WKMS9Lx44O9/H5Dtg2+u8SvQMPeLOULzVcVw9ydjEvcVi7b0IwyW9lmnWvUyePD354WQ90jLNPMj2AL5W8zU9/M/6vTA09b0q+cE6ANeGvSCLjzydSIm9NNugvHwMzb19QsI8Wjznvf6zlD34SCO9mxsRvNbxnzvrl8Y94rVpvQNNAL7bIq09V52uPcDlGT13Pic9eYjePbN+crzW2r48NWZcvXactLxFWdS80XkGPqwMob0tVAc9HnFCvag0mT3GlpQ9GST9vSW/Jb1R6Ze9GgKAvVuFpL1i1L485Z/oPRUQaT0Utbi9lbvUPYwlAT7KVQC+6A5/PaipJb3KtIS9",
        "qyoYPQ6G2D2brc+9ehCpvTxoIr1csuO8lG29vbOyAD7YWvK9yycRPGVL7zyHxZC9PyyQPfVycLwb2Hi9l7hFvLKyV7zF2OE8WedGPScqSTyv3lo9D2RwPe9ggj3l08K9lxHXPXcrWz29mJw8zot/vYCe1j3ttn292hTtPZTZpb2fmGA99UbxPHDH170AwbE8VvujPGh9BD16Hr49c/LhPQBNEjwz1la7mW+DvEb+5D201a49wVW8vQotj73f6IY9XQCovSWSpj2X+BA+HU6avSUaPb3fNoA9G6DAPTm3ar0epVy9LDXLPRqpaT1iwWO90KjgvTVT4b058Tc8fBYdPcPuuL1FQtW9GECfvO/jkb1mIsy9alwWvcslijxzBfw84CNbvfSplz0d2Zc9Vq9RvXghfz1zLUO9lUBiPZK4zrpog5q9MG6IvNN0Cz3whDs9op/DPXCWB75L5ZU9A4LEvUe2gT3q6M695fw6Pd2Q870ukl4929KovZ8b2DsQqkS8XWc8PX2HIT0m0Mk9K3YtvTgu2D2dCCQ9LOYIPDL+xL1hrLg9jtZ7va3/hz1FVU09Yr18PdG7472aXuU9gIjJPYNcGDv2uJS7kJziPd8X7DsbNwG+Fi2nPYLbFz2cxzi989GsPa39/j3XxbY98SnlvTfWrr35b6q93B45PWzfPr3czdm9FHMMveCXYT2180e951knvWaRbz0fYK89KZgvPdtPjr2nbZK8bGLrvBOOAb5Odp69Gbntu6lRg71KPru95233vTYA5r1T70s9u1TBPY8YmL0MV4W9gvDtPbYji73vhnE9KDmpPRfXab18ge89kDp2PWpkw7uE4v274TfHPBsXpj0t4Yk9pCHkvWlpqr1cF0e95MMWPi7Mz73pFgG+QUd7PZtXubvLGha+N05WPKpF/r2LMqA8cssJPgVD4j3QNyK94iSSPdo+QL2PCco9KCXUvSehqL0V+yo+EQmaPa1PBL7qkw8+mMLpPR3YCr2U97g9Ib2GvXdd073fBRY9",
        "sQ7WPaphyz25XHG9/bSnvWFpgj0hem47V0OmuqX2qj0GFhM+1Q/SPXi5O7xNM6C87oALvXDAlz2EAy8+dPP1PKPQFr63BRs+YeigPMRA6T2iUhM+dI+XvfwwiL0jpbS8oygcvft5mr21zt894LO5Peku7jwBjMM9EUnbPK1z571Q9ZG95syhveeHnr028L47l7DKO+x/Q7zgkM+9AGTVvVasr70GBno90XEfO/DM4D3PInA9dKuavSVWA73mhWY9KVOmvbrkGD7I4sA9Cc2ePZRLgzwofra9E3lcPVtg67t1IOo73E2GPREQOLuwTQE+8RexPTFfNL3FSwQ9njqHvfwSWL33dxY9VpluvQMAHL0Xndo9IqFUvQ2RGz2wKHO7I6RVvUqcVD2rwIm9idw9PUF9uj0aJxc+mq6EvXsIxLx04Aa9ugS4PYIEGb0R1Ky9zK0bPcnb1DtfMBO8QNkRvOwEtz2Hng68rOk/vF6d2bwJKBK+9k7ROrwbAT7GLbY7/JwLvOd7HT3a1YW92sClPSKDYz1SgJA95zsQvRKJhry4cRe8tOjcvWhmi71jr8u9/hAwvQXJrD05KtW94+kwPQwiqb1u1u89N+wRvYLszDw7A2G9eFl3PWAsD76dQE49vCGHPcLQdjtTDDe9ZzYqvIhrwD0uTRw8eS6zve6lwbzRcLc98AJyPTXy3D0EkAi+E4r8PRL86Dx6hRk9nD7bPYlL8b2nMtK9HZAIPnRhn7wvLK49eF4dPvLhdzsBaIm8ZcLXvZiCyT1CJ7+7FKAGPnrdor1ltYS92A8evsdyDD4p/+k7iKa9vFROq70Rho08IAktPTpq1j1hUAc+Fg7fPdowuLx6DoE9UUYLPlC5a70SRSe96aEjvq625rvcudO9qbqaPa/hsb3sYYe8Zv6WPYINoj38ftQ8F0UgvuWxsD3RMsU9+pxMPct2vb3II/E8B6iIPQzqjz1/spG8T0GePEpENTyKv4O9hohIvToL0j3KwD+8CdnIPQpvujyfUaO8",
        "w3mtOoETPryVPJA9q2/TPRG8zb0Kno290PB+vUAtPL0brVw9Nr34PeBadDwZ11e84t48vYtDNr3bB709dU/9vc9loT3+IhM+6ldvvMertz0w/gI+wtlVPXwu2Lw8RPi9dm+sPXXxkz0mBty9YrjIPYtyrr2dMO69P0lkvbedPz1rLIi9JpLovFK3kz1PCkm9wI1fvL8PAL4lUki91+YZvg8k5zzGJ2Q92ZBTvbP1arxFQu29sjmfPSOMqT3N1KE9tfFaPCoaxT26vYS99CQAPYDtmT2QBcA3FCOZuowWgzyvWPS8kFm6vW7Jqb1+jeW9KsBuOxkDdDzouZG9/LL1PbbWUz1QR/Y97BSWPSxtS700xeo9gNVhPa5l8j3O0qU9W3qlPWT9Jr3bdk49bQbNvXywPz3Yd7U9sIp5vbXbO7xy9c48ts4hPe6TjruwONO9aQmbPNCRzDzgIRa9rwusvDDY2DyurYO9YHkxvYVR9j0sY9M9O82ZvfGGCb0y/pe9PBKnPcS/Ob2YObY9PLGBPdt8wr1KCQm+mzHuPaYdFL6NU7m9j9C3PRvULL2NTK+9eBgivsXWHr1MLCm9elcAvi9JUbxLKHY8gIyFvVIXFD4nb4Y9PktJvWp6MDwpGRE+Hq/Lvd7YlL3bNPE8LXXhPXcV2D2d7uE9/GTVvWLCBT4MfTy9AZPaPQbO5by/qpS8KjF1vVBmzL0g7im9W0/JveaPrTxZCW896PKpu5uNq70KVtg9amxWPc1kTj2DZ127Im9cvVwJ6LsFypy9fp3fPIk2gL0cUwo9Nz0HPR5BNDxITQM8nnYovcpqIL0+MvK8qYQjPR+7rr1UVdY9ZHCWPbpHdL2Stoq9kAMhuQX2172awb+9ii3YvTy9572ZTAA+8YVgvN4a3bzNJWS9/YeLvDbuFrxnmAA9alApvlArHr0ZDiM8GfLvvcGQSz2V/QU8VLGfvQ8crb0l1My9Qz9BPdeDHj6zYwu9JrT2u8mc1L0QZ6Y9e6mUvRBmFj6L72+7",
        "3YFmPVYSlb0ogB2++8PLvMivXj378ZW96wnRPOfyeT2X4Ye90XeePZ8noT1hqoa8J7nmPQ1bAb5tkfO9eSyAvZrEHb0yCcS9eakLvXeQ2r3NAnC9mDy4vM/vHT3oU0Y9jM0FPhrTGb3yTes9dqDGO56Ou72e5TO91dHlPfiOwrsWmZu9eMKGvaSlyL0Qe9E9NaKgPeAu37308yw9Hah3PYjOBz18eBC9kg4NPfczYz0N3ci9oMHAvQ1Y+DxzY4C8uXRAPeH3hj3WkdY8gtGCPX9TBrvO3H+8k3iYPQI8nrxuN+k6aITAPdArg73eHaW7hId8PAEem7zDrIA9NuEcPTk1hb2te/m6VJpsvUJnfLyc+ba9AYS/Pfzmaz2rV6e9NgmJvYHCpjzZIfi9tfQNvp0W0L1FQy299J0uvRSQuT233dG9xlaNPShEqb0f1ou9NJ4mPTG38r0gQcw9OyISuyF31j2kv7c97013PQwnnz1DdCM9KqURPZ3iDD1VsXG9rtOlPCI8fDycjU08hfD/vDpiQr0186w9sayJPD7LnT0JWQw+t4B6PV0a/b3XozM96TuWPS4Iiz3hpUo95SEWPbPKIz3Dldu8vq+rvVhhHD0h8qK9Ej1LvTYBkbzxZPm9JF3UvXMs7z3CO8M9VSMIPma8sT2JU9Y8X6lrvYf1jz3Q+vS9qlG9vXwhRr3cdLa78X0tvQK7WbsvkvC83cX9PVBVAD2HwA29s5W9vVNcFLwaEag9xM2QvZIX4LyrpLW9WkUEvrx27b0NP2E9U+mevA/5o70iAsU9sMaqPf6olj0s2mM815WaPRvpAT46dFw9E2UxPYvEUz1uCe68z/+XvZ3ln7zy5LM91gnNvMGDxb3LhMA94ozova2ujb2VxLq9c5jLu8Vylz22aag9vCT4vViAfT02LS29bCuoPRt9AD6ip628m0WEvfFhLD1/oII9UsncPZqOgT1WZKa8T52MvaleDTutaSq9vQALPeYVxz3inK09Ai1fvefi/D1s86i9",
        "3axFPVT9Dj1l/GC9oM7QPbCtBD3w/Vs960BgvQTQ4r0sVzE9iSEcPU3n+71ZCo88HkEPPVCbGT0wmgk8UwTOPYWuGz1kea893hsFPDcj6L2j+9K9YciHPV3pvr2tAGi96TZePezIyLzS2Ok9HgS1u7IrQb3tSvQ7fmRwPBjSXD0faJS95h8Jvg3MJr39Pm69UrigvYGaD7774Li96eHAvQ9/Nj3Qlgs8nkYpvY+NdLzrFPu9F7ZWvVmGyb2kC5S9pwX1vVuUxjxiOjY9EAY3PVFltr1wExq+PXZhPT44Ob029Ie8348QvbqjAL03XAg7xVI8uxrbtr3aKYg8T3ynvMCWor1QxG09+T4FPfUv/73ReY890tCMOuHmAD79G5u9sZ3mvTrAhT28TKu94eScPau1Bz6Zxii9OqJpPZo9x701vjI9bn4CPvcCpb3TpJi8U4QKPZ7OLD0KzZc9IDvnvI3k+rxewZu9ye0JPt6N5zxS51c9xWI9vY8soj2idAU+XCF8PZNiLz3dlfw9iTnSPXMr/j3iKGS9PESfvYB3qT1CNqI9PT7EuzlwZzy1H+C9bxKpvRZYvj1EXwm9ZCT/vd3p3L3amwY91LabvACCiL2tBCi8X5rzvSFelD1daKI9LqmlO4FfuDtVYbm97nEgvWHJlL3P1iK9cBb1vFp0SD3ZOc+8TosrvQ7plr3Dz4i9kr9/vELzxDxvtIQ7Qg4vvEdFvL0RXiY88Bl4vZ5JzL0oUMs8IgKdvVk7471BdY690+qQPY162r1BPEA9ZsCqPQ/6qb20DPC9JBvnPZhOyr2U5XU9lac8PZfM/D2yi427XxNuvTRqtj1ETYK9P17/vR6eCj0of9m9Vd5TPb6b1r3U1us9B58EvsQHR72mBQW9F1DfPTBzbb18zZa8DmAAvmnifr2oOsu78ld4PHiP3jxzO648HWPOvFJVqLxW0gk9RO/NPAIqFj3RfPe8gBmUvXHUIj0pYmg9hZXNPe3FSj3Xrdc8irP3vKzKFD2vCtm8",
        "S0p1PWom5j13tdq8GAJWPfEIND0viQO8r7dcvRAK/7zdK7g8HY7jvQ+GkbxdpYa8fTeyvIGA0D1RW4S9zdHHvFOiEL2bhZG9I+85vV/Wj7qpvx+++h1IvXqJn7pjYXm9ZRY3vN3VXT10aBC+vE2ou4Sj9zyRcTE9yUEevaSsij03mwI+sCS4PZEHDzy6j+09TREqPI/yhL33Wdi9Hda4vP5Vpr0E27k9fWuXPRaA673uMIc9xcN0PJipqj1tIMi9dgH+uzGP7rvIjZW90cT4O7f7C76gxpI9hSkEPhTG07ucKmY8cx4wvSV/YL1AbXC9+JQaPVnwHz1qSvY92Ug6vDzmJLyPfo+9yqG1vGwT4j1fTQS+kOaxPca6NL3sKWC9pPSxPa6TAb3TQwg9VcLYvYwhgz3Gcpu8eTrYvXO8+T0he4+8ccG3Pe5uIT2H0dq9bac+vWynkL2sgBU+3asxPVhtmL1kn56994zSPTaN8D0bGJo8dXKEPaZ5KD03v4u9bCTkPJXJrr1yp0k87Y6gPYySJL2WtcA9J+nnPKnWUjxyap49jfViPSPYNj29DpK9tQPUPDNlxzzq3p89njyVPYAluD3/lYs9AfyXvZUcAb70Apc9i0aNvdK6CT5kOqA8czrMvf8Z/D3omBe97Tw8vV43+j0QJBI9cPCKPR9NCb2a17q9nKsUPX/Ayz0O4yw87BVjvYvuBj4QF7698HjdvSjx8LzhWoE9NQzOvQ8ofTz+RY69TVB2vdgzp72vJvc9kOhPPSBNXDz4hQe+hO0xPWK2470vZ/A99d4jPQakMD2cXaW993oVPLoQ071A9o+9HFejPHdIcTw9oeq9etq5u3Vgoz2l35K9l8/OPQ454T0z0qI9F+aavP79gL1jxJM9KZHOvWO2CD4LQbO9W/f+Pc7T5Dw7zB6+7n44PdkovrzDYCe968rDvc8V4r3N7ry9J9yiPRlHqDtkOvg9w5C+Pba49b0c/nC9+gbUvQc+NL1KuQW9rWA+vRwNFb59mxK+",
