{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              8,
              7,
              10
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "batch_input_shape": [
              null,
              8,
              7,
              10
            ],
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              6
            ],
            "name": "conv2d_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              1
            ],
            "name": "conv2d_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              6
            ],
            "name": "conv2d_4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_4"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_5",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_5"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_1",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              6
            ],
            "name": "conv2d_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_6"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              1
            ],
            "name": "conv2d_7",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_7"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              6
            ],
            "name": "conv2d_8",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_8"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_9",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_9"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_2",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_9",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              6
            ],
            "name": "conv2d_10",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_10"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              1
            ],
            "name": "conv2d_11",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_10",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_11"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              6
            ],
            "name": "conv2d_12",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_11",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_12"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_13",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_12",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_13"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_3",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_13",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              6
            ],
            "name": "conv2d_14",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_14"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              1
            ],
            "name": "conv2d_15",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_14",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_15"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              6
            ],
            "name": "conv2d_16",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_15",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_16"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_17",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_16",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_17"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_4",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_17",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_4"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              6
            ],
            "name": "conv2d_18",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_18"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              1
            ],
            "name": "conv2d_19",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_18",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_19"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              6,
              6
            ],
            "name": "conv2d_20",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_19",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_20"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_21",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_20",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_21"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_5",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_21",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_5"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "RandomNormal",
              "config": {
                "mean": 0.0,
                "seed": null,
                "stddev": 0.05
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 1,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        }
      ],
      "name": "sequential_1",
      "output_layers": [
        [
          "dense_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      8,
      7,
      10
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            8,
            7,
            10
          ],
          "values": [
            "OirQv2e44b8IeG8+9ck4PbP2BL88WSQ+vGYZv46hBb4lX2w+mr6APjWlAMDpf2y+9kkvvlNWur8A+j+/yCxZP/0E3j264yi/o1bDvumptr6xgwvA6KSVPuo1BT8iXSA9pSibPwFsn7/P+Y6/eGbIvnOqJb8MsxU/M+n3vvjdVb4jR0W8eSS/PpSCQz7OO6k/3o7yvQ0Z2z/b1Tm/Ky3TPiZgnj8FCva+RkZiP5FrOj+N5ZE/kZexPv74gT7dZZI+Z9ykv7gNqD5zSCo981TJv1PsI7/C2Ae/qCJXvTRY7T2oj5C/VfvDvyjdij+6Ggy/mlMtv7DMMD9Zgx2/gwG+vzsanL+/MJk/dcCivnQKC8DKEE2+JfbgvqfFgb8njAY/6Ew4vnsVTL6DjRA/l0PCvgaEnr/jvce/JmIrP2AxpL0fJQ1AnNjNvzJxZL8xpD8/QQJivnDJrD+h8K6+raSRvxkhPD6lxjG8exeMvyq7i7/iPMG98b2cP1/rib/M0689X70kvy94sD//3Ye/UlgfP8K8JMAvcU4/8+MFwNdBEb+mMUo/8gdYPvoSgb+nTuw+E+UkvZJ3qz93izc/yUxXv8nK/b2/Bdc+75Erv3tp/r7l1hY///xxPxo7Wj1oFv0/dWaeP+lVe74kllC/3TVjPzo7sD+oe069iqgEPq9Ohz5Jn/2/y4SuvxQanj6TKwI+8do3PthVBT+L0Nq+GFNav2MWWT8wkOK+0yiXP8K9cL13nBQ+ir2dPm4i7r5W5t09AVXovvGXtr/gToS+PCiPv1vgsL8Cb9w/WMCmP0E+BT89xpK/eeTAP2zwlr85U1S/kpMMwHuhAj9XW2+9e2zrvofCGsDRd0+/kz28PgC2PD6sw5K/+Shjv0uNbD6xPF2+UFiJv/o45z3pKAjAsjcpPzz3oT8wSuE+VVG+P9nEaD/xTKm/u/jwPJ6sxj+bd/k+FThQPkJjUj9Eec29f2mHP2pcE8DJqFG+u7ZPP139V7+MAZS+H/cDP8Vngz/cp5C9",
            "pcINP5zba79tuCg+kW6FPztcpb7NopC+RPySv7ZIQT+srca+FQ4bvwpn9r8bCQU/PFGkPskpTL81ywE+tLQKP/CpID9GXcG/AVbSvt6HUr+34Eg8ml5xvCNrMb0ZWh69GsYOv8zoy76cQhO/+tNpvzaWEL9pzCI+cFJxvuPL1z8DrXU/7/oZQEBr8j20gsm+6u9ePr2pTb+imc8+HXNMP2aLdT/lX2U+HlYxv+/qrz4ifz2/00i4v8jMDT6LYIC/4jbAPxCGAb1MH5M/nERgP1C4A77+fJg/DMXJPj4AVb9l9Uk/TNR8PsJlIb/Idf6/J74Wv8q0ND7s2Iu/J8aAv01Rur+HmuG+1dCOP9utjb90Qw7AGvibv8w2lz7cJ2E+ZoY1v/9ND8BY/I2/oRkjwP/Ycj9oX4C/nogNv3Rm277xEhM/xte0PywGmb75qAFAGgbBv//wKsDUODQ+BkYXQH4EX7/9Sx8/uRPwPX14Uz/FSn8/OTYTwAZ9Yr8NkoI9qAmKvziZPr7KHhi/+4Wqv508P7/zfwM/rE48P8K7FD8YK8+/oKQtv8DR1rxZy7A/l9CwPr3BSz5MqpQ/ECjpPUn5mb7/6gu/sJrnPsZRmz/MO4M/AjWUP047/z8p8wLAl5izvzykVT/1/w893iaEvzDa1b+cmT8+Wm9Pv/MeFcCpKHs/yLj2vlqCjz/Oj5s9HBEKP02RHD/kmTe/qm/hP1OPKMB7IDM+vi3PP8a/lz6smci+iZfIP4noUz+wahVA1IZFPkdL2D4pIb8/Zr7oPV31Zb856IE+B5JIvkuF+L9gffK+3whWvnsvND7sldu9LWA5P6uQ1z8bloe+YAOovUZOxb7LyW2+ItvRvh+9pL9nNXC+whX3PRF6Er+Isz4/F+ABvydnw78Bzsq+qbU4v+pyjb/Re3S/x5Ipv4t94L9yJeW/P2GUv3YUEMDn3Ko/VakBv1xy276U/wzAJPdVv/S6nb56KOS/z/MiPij/kT5ErY4/4Aqevtg/Tr8jrWM+",
            "DxkeP0T/jj80Eze/lNXRPzTvYr/Joac/f/zmvr7MFL66bZQ+tEiJP7sYnz/6gJu/fJSuvxFHs794NeA/6LRPv2hAdz9561S/jy6XPom69b8eQZ4/28sjPqaXUD42ptU/MyYIv6pVBj6Wtxk/G/X/vrij6b+/tNC+LPHKP35D8r69l6c+N5SPvvqqdb8t/wg+Ovmtvpc2kj8Vc4E9Smlmv5hFP79t4a0+I+QGvye4pz++MJc+ateTPIVU9T5+AMQ+mTFCvzWGpL8G2Nc+utJmv2OSHT74tZS/PFsPv+HYSj9kcXa/gsCAvyaHUr/K0V2+pcYqv3lnsT+dZDE/jkGpPrFJWL8J/yO/CIC/P5M2+j6jiSC/AzqFvrPrRD90FrK/RoSev9f9JD8MwYq/+qlcv859GL/UzBm/R+K1P+qeIj9F4hg/IrsTQNLsMb4a3Vu/oGskP2POOz9E/Ca/aQtSvuc+Sb/I2OM9IjSTv/XpYD7MwNi/+P1Zvu06OD+2X6O+hPVvv/U8Zr+cEow8G7g1v+QwH0C3UKI/jlc1PzsGjr/x3cG+njTIvpbb7j+WQXA/HFZ3P0P1+r9V42s+h4WtvwjSoL/+BNK/BaP3PWYIfT/tYUo/nikxv0MTjD9At58/9HJ9PuAwMD4anCK+KF6KvkkTj79crYi/PbsFwLrViD+Y9Me+9cSVP1+/Cz81z9W+mIuWPijOyD9R7JA/P8QRQK7ON75udQQ/+tErv6AlXr99CjU+Edc1P4g0wr+mIb+9cWgTP0jsOz8G8YY+ijEtvjAqqz7LXsO+wNGOvcgUzj8xIss/jNOPv0Sj2D9gyZA/h9imP4R+UT7Pbdw+1Z5zP65SwD4TUBhANhT0PtGZfj+L+70+1N8IP0Kvpj/dNPG+inTWvqge4b/FQz4/OwizP8YAIL/7Fh89PxpSP2cB0T8="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            1
          ],
          "values": [
            "jfnzQg=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "batch_normalization_1": {
      "beta": [
        "byhDvSPtbbwm70E9+ChgvWk1EDykxgu9uc1+PZq1PbqNG4U98mV7veD7ubydXo28tOV1vaiE9zvHEnG98MhoPScXrrzn6YG9pBEbPe+Ke70M84Y9+5povTk5XD3gXma8SIVnPZeuZ72CWY+9vtODPcjiTj150PC8bRyLPSdKTj0="
      ],
      "gamma": [
        "oul+P8iegD8jrn4/J4+AP+yNfD/wqXs/PASCPzPGeT8dHoA/Jx2DP6xygD/NGH4/UK5+P+EDez8QP4M/WJB/PxEEfj+Scn4/83x4P2xigz9eAX4/b12BPzwjgD+BvHs/amB+P+Ztgj8nN4A/db1/P0wvgT9ToX8/DISBP8+EgD8="
      ],
      "moving_mean": [
        "ow/KQGLzDEFi3RXBGilMQCiaD8HVfMPAlItgwc2yKL8q+DHBpk5YQVNLyEAsz0JA4aZ+QR5qAsFjmnFBN/sJwesexr48bARBOQahwIiXcUF4hB3B5Kp+QYSmN8FMxLw/1GffwMGeJUEo+zhB5K5AwRdnlcA4pbpA+wRMwdfRMsE="
      ],
      "moving_variance": [
        "cBYQQuyKkUIfYYVCWb6DQa82TkKpMgFChrAvQ3NIAkEW8atC2XAQQzXrmUJm1rhBRRIjQ94beELxiyxDuMJ0QnknTEFFV0RCIfevQTGXO0PGmYhC7os+Q1QGqkJDP0FBdaAKQq9lpkKAb9BCxgEGQ5BAx0HpDExCBqcJQ5bHxUI="
      ]
    },
    "batch_normalization_2": {
      "beta": [
        "zpsSvQfgTL2/A2u95e65Pdf8tLwpt669qDlbPRGDn70145a9jZmqPeiFWz2/G3Y8bfNMvaB0jz1d4pM7JkcovUwju7qVXIQ9dq4jvCWGU73G1mw9CWKVvUw/7Tzi5Yq9PvF8ve+bQL1rQwI9DiWAvRcjCT3dyFu5RVcbvKeZAL0="
      ],
      "gamma": [
        "ZlV8P27wgT+Rd4A/j7x+P0ZDfT8oO4A/bSGCP/S/fT8nGn4/Zzd4P9BWhD/feH0/bfCBP+TRgT+qxIA/tnx/P/MrfT92Nnw/IcuBP0tpgT81QIE/dnp8P++EgT+Utn0/YRaBP0tEfz9nQoM/Qp9/PyEugD8jV38/8Pd7P/4tgj8="
      ],
      "moving_mean": [
        "nQQuwJIFM0EtsPNAKa/8QMiW6kCIRxDBY6UuwdGV2sDkgXrAi6nVQHzuZcFrRW1ALCxuQIF+WcGgvVBAtR38QEmu5ECEDwDBW3swQUZOKkEyCPzAzDp7vVrTlcAvst8/A4QGQZQprD+AFUbBGJzlQM2e8D9I6sfAOMXCQN1VD8E="
      ],
      "moving_variance": [
        "cavVQqHTC0PMRN5CEnGfQqVLeELEONVCT0EKQz+EQ0IBPoNCEenTQgPAckPRJWRCOkoCQ6pMl0PleIZCP/SwQjwWfkJumWNDLZcHQ71kCkP+/7ZD8cKYQzQrnEKOcMhDEjzBQ/Oiw0GHjkBDwQm3Q7pokUJ2IuBCw+mXQmnmfUM="
      ]
    },
    "batch_normalization_3": {
      "beta": [
        "5uMVuiCgIbz3lYS83FMGveV+gLuUiWu9R1NoPXG/4zy+NjA9O64CvZLt6jz1S1C9ak7RvEDsLr0qg4a65GAIvYeuVL064/+8fP58PdojD700UdE8+BFVPa8U+rwLFig8r0xMPVoemb00aHO9iSd1vVKfMj0Tcyy9II+IPKnBgD0="
      ],
      "gamma": [
        "eQyAP1bJfz9pNoE/YQaAP2mOgD+RQYA/8dKCP8g1gD8UfoA/jGV9Py5Cfj8siIA//IyBP5BGgD8CaoA/1O+AP/5PfD8M3n8/9maAPybagD+JnIA/Fgd+Py0efT/ki34/6imBP4hpgz92DoE/li18P/LTfD/DgIA/r75+P7M2gz8="
      ],
      "moving_mean": [
        "mx0MwMkpMcBW1xk/A03TP9WBgUDAerZAmAc9wG7ioMDS7KzARLBvwKiGdsD7/YJAERlRv4dUFb7wfzzAFnSRwJVlI79ydLVAyc1WwGEGSUA+D0jAC7IaPtkRNsBcDNa/2rK6wIlJEEGiDLlAncalwL7RBb9J16s/puoFwIOzmsA="
      ],
      "moving_variance": [
        "n1eNQs9nMELxFIRBX2XDQplMXkIkkRtD7MMhQ8jMuEJ+iY5CbPvPQs/FhkJuANBClGDYQXXpn0KnGw1C/MgAQs5HcULiVYFCLK6kQiVJ+kLSgrlCbiQhQtAHd0IVWKNCFP7EQu9QKkNikalCmuxCQql6sUKqYehC4Ui9QXM1zUI="
      ]
    },
    "batch_normalization_4": {
      "beta": [
        "Y0lBPd4+p7zz2WO9SyEzvf1VML0aPXQ9yfqhO7bvJj1kVGq87h4MPQQIW73H45w82vNuvTU2Zj0DACi8I59avIWP8rwMgCY9djilvLftmL2ekHG94ySRPdeXEz1Xp2i6ZlRLPdnqZr1JwTu9+WkxvQllgz1JGG29mxIQvfzehL0="
      ],
      "gamma": [
        "53B+P0NKgD9TMn0/chKBPwQKgT9ekn0/8fR8P2O0fz/Z54E/z2F/PzBGgD+tKYE/Tl+APwOlgT8aE4E/C+t6P/JTgD/bUn4/wAF+P6zNgD/B44E/zkKCP1dbgD/KuIA/4diAP6mtez8mx30/ufl9P73WgT8K1oA/d0qAPw/Sfj8="
      ],
      "moving_mean": [
        "OwyLP5VrVL7IxRM/ZlG/vksuWL7Xlnm+IGqCv8mU9r/2LlM/lHfKP54/oD8U/ds+p5oVQGgYMcAhrwI/xlU3P9IyHz93tf+/7o6hv6klE0DJTDtAe6EOwK01YT6JK04/8Yurv/LiGD9V9ug/GDMnvizIIcA6rzhAM5DOvZ2rc74="
      ],
      "moving_variance": [
        "4ujSQbZ/vUGHtLZBGhp/QdRrJUJsyvRBFUCmQTtdykHEqTpC5c/pQQ4EAUIkUHJBaVINQts61kE40dZB84nOQeV0D0KI3OpBIeehQerFwEGDHCtC02eCQQA5CkLh3tlB81DEQRY2uEHPeqFBoEqzQcDT5UEEpzpC4xEKQms4FEI="
      ]
    },
    "batch_normalization_5": {
      "beta": [
        "P+E0PSS6Jj2dYCc9uH48PbAOU71c9YU9CKwfvaddFb2thie9oEU+PXK4Nz0NYza9WoUTPTWRa73KNGk9yLpBPVYrH70LLz29AzpBvb6tK70qskG9KmM2vbEkLL38XXk9q7NWveznKr2KA4Q7AxQ5PRIuLL236+s8/edLvYIEJT0="
      ],
      "gamma": [
        "CwWDPxbggT+3DII/QiGDPyWfgj8+wYI/NvGCP5p/gj/WpYI/zWWCP0Ebgz+7joI/hu2CP9oFgz9He4I/diKDP1bUgj+CP4M/dOKCP1YOgz/HcoI/V++CP8irgj9e+4I/ebCCP2Cpgj+4MoM/NDmDP93qgj+Xc4M/Dd6CP5FUgz8="
      ],
      "moving_mean": [
        "HpPFvyttJ7+B39a9+QBhPwCmVz+zqAvAplwrPc5bjj4zBEA/LH7kv51deL8kkfw+IBa8P8zSOj8xiee/9uJZv6Dwaj8Iuco/5doePpLbdz4GArQ/d1rcPpmgkD/F9pA/dp/APw8okD/Cf4O/T8UBvr2sGL26Q1U/UxwAP4O/zb0="
      ],
      "moving_variance": [
        "XGvGQrFlE0MImgdDQ6bgQhcq40LHladC4LcVQyRxy0LDWPpCUpqPQiUt1UI+NrlCbk37QsenrELjFZBCsb/zQppG0UIZUbpCKaCcQsBECkNOqThDjR71Qq5QfUKnbbZC9zSmQtu4jkK+DfpC94WuQnLDLUO/dPlCoFF/Qk216UI="
      ]
    },
    "conv2d_1": {
      "bias": [
        "wEFjPT50XL2M71O9f2PBOyqKSr21Dly9Fx3nvNQXcD0SlWI94SZCPQUTKb3EpU29xNxMPfZ1Sb2eYWI9NDItPaYMEj1maF09w5/GPDg+OD0A/GS91oFYPThNVT2VG1+9irYmPY54xryW/Ey9oA1ovXl1AL0LelG9Ll3ovD36z7s="
      ],
      "weights": [
        "Iiq3Pb2Ewbw6Ngo+dEf+uyBE6D1wLms8mZ+xvGeepjz8JBQ8YhTlPUE29TyKnig+6GC4PSqDFbzAoJ27YqyHvSg8AzuTVDq9WVXqvT/2FT2kUyi9XFrxPf5WxbvHNcs9fMsAPmLKrT1aRAW+WNhBPVwCALy5IdG9mT7ovZkTbD3KB4g9zmULPkCUjjugbZg8lByJvZE6oTwBb9y9I2FVvQEujD1YzlS83nquPFtrLDtAm7q8gPTEupqQyT1YXP49KzfWvSiKPr1IOxY+3isKPvM3HDy/W5Y6JC8GvYjoMb2cHJO9cU9iPT8jzrzEltk9hfP2vVy+KT1S+yC9esP5vfMXtr32VNa9sOyqvOWIiL388/89sHjfPabyij3oaHU9khBbvdgysTx0qtc9ScDWvQT6lL1uCcC9jma3PUpR3j1Ayis9l/+IvXAcbT2ov+o9TEONPXU+/r3KuJQ9HNqqPcb4OL0UFdE97vfRPTdTA74cxc29pQaRPUBQjj3IlvW9dR+YPdCTpL2uud89/McDvsI2jb38SQC+Kr+2vLxlhT2HmMu9tLHAvc3VqT1LNsQ91QykPZoo1T00BhY9fcvnvPUycr2Sw/Y8UopovfE6wL0FQLS8Gyb0PFjNo73t5Fs9BGfFvYzKwbzfzK09AZvAveZC9L34ah68EKOSPXjd7L3/9ps7eGq6vX6BJb7byce9oCHrvXVXirwYgSm9UpcgveWfwb0KuNi9dK75PdMAgD2RDhi8/9ujup9XID0I0229dIf5vNP/+b2XgqU9KcLfPYA0o723ZN+8lKaYPXaakb0aeaw9XLU7PQD42jk05ue9TNCcvTbS+j3mMJ09LAK+PahT5zzU5YA9sCdqPUx33T3u38U9nojYPfDnrD1Yozi8skoZvQIMGL1YiD49Tr+UPQCTa724KIs85g5avZSk8b0U2WI9kCNfvcBJFT2cUHs9QMNCPYV6rrzMoAu9nKqxPEA3Nzt4J1O9mSqMvbduQL37Tw+8jHzZvbirFL4u0Bq+",
        "bIjNPNGKFzzgEy483JqhvMh6570PFue9PMBxPa9LIj0SdB2+ciF6vX5a0L2tKAy9LkPSPehjbrysvJS9XipnvVu0Bj4uMVG9zACKPSCbjLwt7rc83HsqvgDptDrelck9vKekPchu5Lwx6Ys7JFwwvsrgDr4JXQC+1sMDPDViHrwgpye8lEsxvUMXSb0SD589/poGPeyYZb1FwLa9MBYPvueJuD1JMHq92AqkvXA5azxS//K8lr3QvSZhgr3fX0C9bvbiPT63ir2ASec9jLkaPeII4D2A4v09YAvTvP8pvL2w3nc8b++evWwStr0yL6g910jPvahDDz2gg7M8ALo/PRgX4b2UN7m9oBTXu3i9/z0C9tg93KC1vbi2y72ZOPa9ZhXePQEwo71Wlto9GBBrPUBHNjzw8/o8kCfVPB0vGr1Mlh6+e8fZvVzrTT2isvC94gT3u6skaL0cTSw9LU2OvSmGDb6lxxi+Ey/TvTx/ez1grz+7osMAvUMBOT197c69gZuqvT7nwT33GXI9ypd1vUh2HzqHcqk8IOTnu+T4lz1CrKe8/4vGPL6+Lj1N7Zi9PDbEPbXeXr0yMC08wAlAvd8w0b3+SYy9IDexvQiU9L2FR1y94EqhvUxJSr2S5sm9oXOFvQ9yq714ibe93j/pvZ5Bn70GgsC92jRBvaqoJ734Nv29Sn9hvQLK2byMrTE9z+nZvTBB5TyklPm7oqIPvUTzkb2qa7c96jSDPTgFZLyu/ia9FImfPcZ1kD0k8XM9+osTvfhO27yQj189OCwmPVAt3z2Whu69JiuwPQCvNzogUaU84BP8PbaG6L069hW9oDiaPS7X7b1EwfC97BrEPZIptD1+5CC9gPSAPB4Dyj0+zq29kvfHPYAzDbuy5IY9QleUPS2Wi7x97S698UM3vGIUiD2wfcY9BXHKPS+F4z2MlhE9DVUAvoqRD765eLk6U14YPGKcnT2g9R+7grvzvbRzGD3RSI68QrT0vC1QpL2V8Ay9PJAYvkGMnj2XvpU9",
        "Y6bfvUYXkT1V9Nw9jA7pPSyUPz0dJrs8pGKyvUiaGL6VIs+9lGGcvZD1cjzkhdo9/EWhvMUkvT08EAg8P+GVPQXHC76HAKi6M09FPUZjgbvZFPK9rSvzvY4RL7m8WL69LDCcvJjYmT0yAG08xzAFvVreXrwvl549TP4KPXilDT20Z449uKQ4PHJgAz5pGRy9EHZkvZYlf70gqBU88rVNvfz/mr0Udc89Nz6MvfSBGj0KSPW9TpHjPWApyjs0iW89ZgZvvQgtlrw4ENA9imxavQDWrjqMZRY90lLgPbT+oT2QaK68UBL7PIxBW73ovI09TDkkPaLnU73Mfey9qKu3vFBYiDyUd589++ravQtaBj1bICI9vw4SvZQnEj0A4G+4XJjAPchoFL0wf5I79Aj4PV7iOL51DsE9qYCfPTI10T1GUhu9kF1wPVTaQD37MX49gt90POtUUL1p/ve9IyWPveEbxT3E2MS9Eq9kvVxytj2A8NQ9vZbTvB595z0eeRI7HGXxPQFtKzyFHOg90VesPeha+z1CSo09jwy7vaeOp72PVSW900WdPeLp7b1dXhA9L06DvI7WDr5MLXo9X7fAvUGfOr0aK8O8DEcePVbn6D3NzCO8xMNhvMDxBD6or2I9Mb/dvaV+0L0hO5g9nfR9PFWpwT2e4ES84OnAvUIs4b3etKq9rmqrPXkY+L1cRt69wq6HPZI1zr3ZooC9eGW8vGo8nT1MD629oBK+OyRoEL24d+i90LJ/PbybqD0OIpq9JPkqPdiHvD0AKsu6DjlEvYADyT0EavY9IKORvbx93j2MCYO8EM7IvO568r14N+M8LHTGvYN+Gr3OhhA9AN4Ivpg/Nj2zqqW9YWiKvSXpyD0xOVW9EJ2QPbyoTjs9I0298Io4Pd00RD18RKY9bIqwvVRHvj0gKv697hNZPf/+Fb4/m1K9Kc+svUeZDr1Z5+k8yLTZvZQcFT0YToM9xGl6vT5gfj2hwq+6VMJGPXrF/7wlTDA8hFE1vejhKz0QWBO9",
        "CH+WvaoZPrtoNYK7GGKLPVBbfbz4IHO9gwPYvR90LL2wq667HK02PRfTmT3xbHI9b+zOPSOux71jRgU+hqGKPR3g2b3ag/M8cLdLPYRT6D0nBmK9ttbOvee+1rxYh/u9lCe9Pcq1Fb3w/J09zMMIPR3+sL2QdYc9YoBuvf5B1T38iR49nHvovKDJxbwgqAQ88lLaPXSKOr0wGJ48wKyKPCb/8T1W59M91PiXPSzajL0k9Zu8QA4pPRrWmz38Q749sCZcPXiniz0mS9Y9plH3vX/wgb0wSy48IfvTvc8caz3xTuC8U7yoPBZWBL2Q1fE8/ZzmPdxxbj2EN7c9DlrvuiLTPT7XF7y8fzUdPRF1GT5IZ6c9/F8BPWoWWr2kGj48ykysvMpwuj3W/F29J5jlPfIHc70a1uE9xkT4vfKR670A2Uy9YGijvct4xD1lRKi8+ESlvJllCD3jJeE9Ocn3PGkrhr32Cbg9AtbgPNNgg73c4168aITuupYQGT6ic+O6f9nrPZ5VLz3gJiM9GFjxPE2Vzry8Oqe8lMeaPfA7DT4NZwI+9tAVvcmrLz27k/C8PALyPc1+pL2rq9W9i/roPOE1hbxBIi09wlWWvUDEy7qwl/w9HgoAvbDXXr18PVu9LHGtPbRKKT0AsNa6kKhgPJCCNL1EUBw98lV1vfhgkTxw83I8QGp/Pao/+z3i+Yk9zuuBPYyDuLz2c7+9ctbOvdCvoDwgVJk8Mv1VvSwzsz3IRGm9zBaEvTwCZz2d34m9pOIVPVTqGz4H37c9nul9vGCAzbwUjsq9xXmHvdKkL70Jgjw9v3KJPQXVSbxuLUs9I0CUvDKnjLymyOI9rkLiPaBXurzSIKe9KoYvPWS6GD0vLdA9yOmXvKTIxryuoBI+vKFlPbDIqT0lBai9kZTHPH0sF7wYv2g8YCDVO3iWN73vnz4931K8vV8m/73mQxa9E8/5PfTkmj2kq949wHwoPN0wyz1u0zy9hBAKPuHsCz5YJ6m9YJmlPdLSmDyfDuw8",
